In [1]:
import pandas as pd

In [5]:
import numpy as np
df=pd.DataFrame({'key1':['a','a','b','b','a'],
                 'key2':['one','two','one','two','one'],
                 'data1':np.random.randn(5),
                 'data2':np.random.randn(5)})

In [6]:
df

  key1 key2     data1     data2
0    a  one  0.513027 -0.147154
1    a  two  0.551492 -1.320739
2    b  one  1.119683  1.437847
3    b  two  0.157070  1.604983
4    a  one  1.328521 -0.538877

In [7]:
grouped=df['data1'].groupby(df['key1'])

In [8]:
grouped

In [9]:
grouped.mean()

key1
a    0.797680
b    0.638377
Name: data1, dtype: float64

In [12]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [13]:
means

key1  key2
a     one     0.920774
      two     0.551492
b     one     1.119683
      two     0.157070
Name: data1, dtype: float64

In [14]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],
                 'key2':['one','two','one','two','one'],
                 'data1':np.random.randn(5),
                 'data2':np.random.randn(5)})

In [15]:
df

  key1 key2     data1     data2
0    a  one -1.260883  1.173608
1    a  two  0.778031  2.808174
2    b  one  1.793071 -0.543632
3    b  two -0.610060 -1.391975
4    a  one -0.400419  1.129847

In [16]:
means.unstack()

key2       one       two
key1
a     0.920774  0.551492
b     1.119683  0.157070

In [17]:
states=np.array(['Ohio','California','Ohio','Ohio'])

In [18]:
years=np.array([2005,2005,2006,2005,2006])

In [21]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.294424  1.703876
b     0.591505 -0.967804

In [22]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.830651  1.151728
     two   0.778031  2.808174
b    one   1.793071 -0.543632
     two  -0.610060 -1.391975

In [23]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [25]:
df.pd.DataFrame({'key1':['a','a','b','b','a'],
                 'key2':['one','two','one','two','one'],
                 'data1':np.random.randn(5),
                 'data2':np.random.randn(5)})

AttributeError: 'DataFrame' object has no attribute 'pd'

In [29]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.260883  1.173608
1    a  two  0.778031  2.808174
4    a  one -0.400419  1.129847
b
  key1 key2     data1     data2
2    b  one  1.793071 -0.543632
3    b  two -0.610060 -1.391975

In [30]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.260883  1.173608
4    a  one -0.400419  1.129847
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.778031  2.808174
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.793071 -0.543632
('b', 'two')
  key1 key2    data1     data2
3    b  two -0.61006 -1.391975

In [31]:
pieces=dict(list(df.groupby('key1')))

In [32]:
pieces['b']

  key1 key2     data1     data2
2    b  one  1.793071 -0.543632
3    b  two -0.610060 -1.391975

In [33]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [34]:
grouped=df.groupby(df.dtypes,axis=1)

In [35]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -1.260883  1.173608
1  0.778031  2.808174
2  1.793071 -0.543632
3 -0.610060 -1.391975
4 -0.400419  1.129847
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [38]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   1.151728
     two   2.808174
b    one  -0.543632
     two  -1.391975

In [39]:
s_grouped=df.groupby(['key1','key2'])['data2']
s_grouped
s_grouped.mean()

key1  key2
a     one     1.151728
      two     2.808174
b     one    -0.543632
      two    -1.391975
Name: data2, dtype: float64

In [44]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=['a','b','c','d','e'],
                   index=['Joe','Steve','Wes','Jim','Travis'])

In [45]:
people.iloc[2:3,[1,2]]=np.nan #Add a few NA values

In [46]:
people

               a         b         c         d         e
Joe     0.833892 -0.108376 -1.004406  0.509357 -0.191917
Steve   1.383753 -0.302404 -1.330934  0.591792 -2.818875
Wes     0.233886       NaN       NaN  1.099966  0.019551
Jim    -0.389989 -0.631191 -0.220844  0.264092  1.385455
Travis  0.384702 -0.040664  0.210703 -0.791329  0.979768

In [47]:
mapping={'a':'red','b':'red','c':'blue',
         'd':'blue','e':'red','f':'orange'}

In [48]:
by_column=people.groupby(mapping,axis=1)
by_column.sum()

            blue       red
Joe    -0.495048  0.533599
Steve  -0.739142 -1.737525
Wes     1.099966  0.253437
Jim     0.043248  0.364275
Travis -0.580626  1.323807

In [49]:
map_series=pd.Series(mapping)
map_series
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [50]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.677790 -0.739568 -1.225250  1.873415  1.213088
5  1.383753 -0.302404 -1.330934  0.591792 -2.818875
6  0.384702 -0.040664  0.210703 -0.791329  0.979768

In [51]:
key_list=['one','one','one','two','two']
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one  0.233886 -0.108376 -1.004406  0.509357 -0.191917
  two -0.389989 -0.631191 -0.220844  0.264092  1.385455
5 one  1.383753 -0.302404 -1.330934  0.591792 -2.818875
6 two  0.384702 -0.040664  0.210703 -0.791329  0.979768

In [65]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                  [1,3,5,1,3]],
                                  names=['city','tenor'])
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)
hier_df

city         US                            JP
tenor         1         3         5         1         3
0     -1.438876  1.736130  0.020323  0.727322 -0.348357
1     -0.642260  1.216109 -0.259882  0.857314 -0.664631
2     -0.574450 -2.423473  1.561991  0.675864  0.387912
3     -1.643343  0.174036 -1.970018  0.131062  0.433442

In [ ]:
hier_df.groupby(level='city',axis=1).